Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>testground</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository_file.this["github-mgmt/CODEOWNERS"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            *       @galargh
        EOT
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "github-mgmt"
      + sha                 = (known after apply)
    }

  # github_team_membership.this["w3dt-stewards:BigLep"] will be updated in-place
  ~ resource "github_team_membership" "this" {
        id       = "6319375:BigLep"
      ~ role     = "maintainer" -> "member"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.this["w3dt-stewards:galargh"] will be updated in-place
  ~ resource "github_team_membership" "this" {
        id       = "6319375:galargh"
      ~ role     = "maintainer" -> "member"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.this["w3dt-stewards:laurentsenta"] will be updated in-place
  ~ resource "github_team_membership" "this" {
        id       = "6319375:laurentsenta"
      ~ role     = "maintainer" -> "member"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.this["w3dt-stewards:github-mgmt"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "github-mgmt"
      + team_id    = "6319375"
    }

Plan: 2 to add, 3 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->